БухЭксп/Catalogs/CW_ДоходыНерезидентовСведенияОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ДоходыНерезидентовСведенияОДоходах</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеРаздел42</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТабличногоДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ДоходыНерезидентовЯчейкиРаздела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ДоходыНерезидентовСведенияОДоходах/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() тогда     
		Объект.Приказ = ПолучитьПриказПоДате(); 
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Конецесли;   
	
	СформироватьСпискиВыбора();
	
	ЗаполнитьДанныеФормыПриложения();
	
	Если Параметры.Ключ.Пустая() тогда     
		Макет = CW_ДоходыНерезидентовДополнительный.ПолучитьМакетПоИмени(ИмяМакета);
		ТабличныйДокумент.Вывести(Макет);
	Конецесли;   
	
	СформироватьСтруктуруЦветовРаскраски(ЭтаФорма);

	УстановитьДоступностьОбластей(ЭтаФорма);
	
	УстановитьНадписьПредупреждения();
	
КонецПроцедуры     

&НаСервере
Процедура СформироватьСтруктуруЦветовРаскраски(Форма) Экспорт

	Цвета = РегламентированнаяОтчетность.КоллекцияЦветовРаскраски();
	Форма.мСтруктураЦветовРаскраски = Новый Структура;
	Форма.мСтруктураЦветовРаскраски.Вставить("_1", Цвета.ЦветЗаполняетсяТолькоВручную);
	Форма.мСтруктураЦветовРаскраски.Вставить("_2", Цвета.ЦветЗаполняетсяАвтоКорректир);
	Форма.мСтруктураЦветовРаскраски.Вставить("_3", Цвета.ЦветЗаполняетсяАвтоБезКорректир);
	Форма.мСтруктураЦветовРаскраски.Вставить("_4", Цвета.ЦветЗаполняетсяАвтоАрифметика);
	Форма.мСтруктураЦветовРаскраски.Вставить("_0", Цвета.ЦветЗаполняетсяОднозначноВручную);
	Форма.мСтруктураЦветовРаскраски.Вставить("_5", Цвета.ЦветЗаполняетсяАвтоматически);
	Форма.мСтруктураЦветовРаскраски.Вставить("_6", Цвета.ЦветАвто);
	Форма.мСтруктураЦветовРаскраски.Вставить("_7", Цвета.ЦветЗаполняетсяАвтоБезКорректир);

КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ВремТабличныйДокумент = ТекущийОбъект.ХранилищеТабличногоДокумента.Получить();	

	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(ВремТабличныйДокумент);
	
КонецПроцедуры   

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УстановитьДатуОбъекта();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Раздел42 = CW_ДоходыНерезидентовДополнительный.ДанныеТабличногоДокумента(ТабличныйДокумент, СтруктураРаздела["Раздел42"]);
	ТекущийОбъект.ХранилищеРаздел42	= Новый ХранилищеЗначения(Раздел42, Новый СжатиеДанных(9));
	
	//Храним табличный документ, чтобы не возиться с деревом при повтором открытии
	ТекущийОбъект.ХранилищеТабличногоДокумента = Новый ХранилищеЗначения(ТабличныйДокумент, Новый СжатиеДанных(9));	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСпискиВыбора()
	
	МакетСоставаПоказателей = Отчеты.РегламентированныйОтчетДоходыИностраннымОрганизациям.ПолучитьМакет("СпискиВыбора2023Кв4");
	
	КоллекцияСписковВыбора = Новый Соответствие;
	Для Каждого Область Из МакетСоставаПоказателей.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			ТаблСписка = Новый ТаблицаЗначений;
			ТаблСписка.Колонки.Добавить("Код",,,
				МакетСоставаПоказателей.Область(ВерхОбласти, 1, ВерхОбласти, 1).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("Название",,,
				МакетСоставаПоказателей.Область(ВерхОбласти, 2, ВерхОбласти, 2).ШиринаКолонки);
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
				Если КодПоказателя <> "###" Тогда
					НовСтрока = ТаблСписка.Добавить();
					НовСтрока.Код = КодПоказателя;
					НовСтрока.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
				КонецЕсли;
			КонецЦикла;
			КоллекцияСписковВыбора.Вставить(Область.Имя, ТаблСписка);
		КонецЕсли;
	КонецЦикла;
	
	СвойстваПоказателей.Очистить();
	
	//Раздел 4.2.
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000420001403", 1, ,
		"Выбор признака наличия ведомости", КоллекцияСписковВыбора["ПризнакиДаНет"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000420003003", 2, ,
		"Выбор кода дохода", КоллекцияСписковВыбора["КодыДоходаПодр42"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000420004003", 5, ,
		"Выбор символа дохода", КоллекцияСписковВыбора["СимволыДохода"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000420010003", 1, ,
		"Выбор основания освобождения", КоллекцияСписковВыбора["ОснованияОсвобожденияОтУплНал"]);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьПредупреждения()
	
	Элементы.ГруппаПредупреждение.Видимость = Объект.ТребуетсяЗаполнение
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПриказПоДате()  
	
	Возврат CW_ДоходыНерезидентовДополнительный.ПолучитьАктуальныйПриказ(ТекущаяДата());
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеФормыПриложения()
	
	//Нужно перезаполнить данные прилдожения
	СоответствиеПриказаИмениМакета = CW_ДоходыНерезидентовДополнительный.ПолучитьСоответствиеПриказаИмениМакета();
	ИмяМакета = СоответствиеПриказаИмениМакета.Получить(Объект.Приказ); 
	
	Если Не ПустаяСтрока(ИмяМакета) Тогда
		УстановитьСтруктуруРаздела();
	КонецЕсли;
	
	Возврат Не ПустаяСтрока(ИмяМакета);
		
КонецФункции    

&НаСервере
Процедура УстановитьСтруктуруРаздела()
	
	Структура = CW_ДоходыНерезидентовДополнительный.ПолучитьСтруктуруРаздела(Объект.Приказ);
	Если Структура = Неопределено Тогда
		ВызватьИсключение "Не удалось получить структуру приложения!";
	КонецЕсли;  
	
	СтруктураРаздела 	= новый ФиксированнаяСтруктура(Структура);
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументДвиженияПриИзменении(Элемент)
	УстановитьДатуОбъекта();
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуОбъекта()
	Объект.Дата = Объект.Документ.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если Элементы.ТабличныйДокумент.Защита Тогда
		Возврат;
	КонецЕсли;
	// ПроцессыОбработкиДокументов
	Если Область.Имя = "П000420006003" Тогда
		
		СтандартнаяОбработка = Ложь;
		ФормаВыбора = ПолучитьФорму(
		"Справочник.Валюты.ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтаФорма);
		ФормаВыбора.Заголовок = "Выбор кода валюты";
		ДополнительныеПараметры = Новый Структура("Область", Область);
		ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОткрытьФормуВыбораВалютыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.Открыть();
		
	Иначе
		
		ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтаФорма, Область.Имя);
		Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений.Количество() > 0 Тогда
			КодПоказателя = ПараметрВводаПоля.Показатель;
			КопироватьДанныеФормы(ПараметрВводаПоля.ТаблицаЗначений, ТЗВыбора);
			ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ТЗВыбора, СтандартнаяОбработка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказатель(Элемент, Область, КодПоказателя, Знач ЭтоСумма, Знач ТекстВыбора, ТаблицаВыбора, СтандартнаяОбработка, КолонкаПоиска = "Код") Экспорт
	
	Если ТаблицаВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Разделитель = ?(Лев(Область.Имя, СтрДлина(КодПоказателя) + 1) = КодПоказателя + "_", "_", "");
	ИндексОбласти = 1;
	ИсходноеЗначение = "";
	Пока ЭтаФорма[ТекущийЭлемент.Имя].Области.Найти(КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")) <> Неопределено Цикл
		ИсходноеЗначение = ИсходноеЗначение + Строка(ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")].Значение);
		ИндексОбласти = ИндексОбласти + 1;
	КонецЦикла;
	ИсходноеЗначение = СокрЛП(ИсходноеЗначение);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          ТекстВыбора);
	ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаВыбора);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
	
	ДополнительныеПараметры = Новый Структура("ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, Элемент", ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, Элемент);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиПоказательЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказательЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ИндексОбласти = ДополнительныеПараметры.ИндексОбласти;
	КодПоказателя = ДополнительныеПараметры.КодПоказателя;
	КолонкаПоиска = ДополнительныеПараметры.КолонкаПоиска;
	Область = ДополнительныеПараметры.Область;
	Разделитель = ДополнительныеПараметры.Разделитель;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Область.Значение = РезультатВыбора[КолонкаПоиска];
	
	Модифицированность = Истина;
	
	ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область);
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	// ПроцессыОбработкиДокументов
	Если Элементы.ТабличныйДокумент.Защита Тогда
		Возврат;
	КонецЕсли;
	// ПроцессыОбработкиДокументов
	
	ИмяПоказателя = Область.Имя;
	ЗначПоказателя = Область.Значение;
	
	ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтаФорма, ИмяПоказателя);
	
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений.Количество() > 0 Тогда
		КопироватьДанныеФормы(ПараметрВводаПоля.ТаблицаЗначений, ТЗВыбора);
		ЭлТЗВыбора = ТЗВыбора.НайтиСтроки(Новый Структура("Код", ЗначПоказателя));
	КонецЕсли;
	
	
	Если Область.Имя = "П000310002003" ИЛИ Область.Имя = "П000310002004"
		ИЛИ Область.Имя = "П000410001003" ИЛИ Область.Имя = "П000410001004" Тогда
		ПолнНаимОрг = СокрЛП(Область.Значение);
		ПолнНаимОргДлина = СтрДлина(ПолнНаимОрг);
		УсловиеНеВыполнено = Ложь;
		Для Ном = 1 По ПолнНаимОргДлина Цикл
			ТекСимв = Сред(ПолнНаимОрг, Ном, 1);
			Если ТекСимв = " " Тогда
				Продолжить;
			ИначеЕсли Область.Имя = "П000310002003" ИЛИ Область.Имя = "П000410001003" Тогда
				УсловиеНеВыполнено = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(ТекСимв);
				ТекстСообщ = НСтр("ru='Полное наименование иностранной организации (в русской транскрипции) не должно содержать символы латинского алфавита. Значение очищено'");
			Иначе
				УсловиеНеВыполнено = СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(ТекСимв);
				ТекстСообщ = НСтр("ru='Полное наименование иностранной организации (в латинской транскрипции) не должно содержать символы кириллического алфавита. Значение очищено'");
			КонецЕсли;
			Если УсловиеНеВыполнено Тогда
				Область.Очистить();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстСообщ;
				Сообщение.Сообщить();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяПоказателя = "П000310000103" ИЛИ ИмяПоказателя = "П000410000103" Тогда
		
		СтрокаИзЦифр = "";
		ДлинаСтроки = СтрДлина(Область.Значение);
		Для ПозицияСимвола = 1 По ДлинаСтроки Цикл
			ТекущийСимвол = Сред(Область.Значение, ПозицияСимвола, 1);
			Если СтрНайти("0123456789", ТекущийСимвол) > 0 Тогда
				СтрокаИзЦифр = СтрокаИзЦифр + ТекущийСимвол;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(СтрокаИзЦифр) Тогда
			СтрокаИзЦифр = Формат(Число(СтрокаИзЦифр), "ЧЦ=12; ЧВН=; ЧГ=");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяПоказателя = "П000320001603" ИЛИ ИмяПоказателя = "П000420002003" Тогда
		
		НомерВедомости = СокрЛП(ЗначПоказателя);
		
		Если ЗначениеЗаполнено(НомерВедомости) Тогда
			
			ТекстСообщенияОбщий = НСтр(
			"ru='Номер ведомости банковского контроля должен соответствовать шаблону ""ХХХХХХХХ/ХХХХ/ХХХХ/Х/Х"" (X - число от 0 до 9). Значение очищено'");
			
			Если СтрДлина(НомерВедомости) <> 22 Тогда
				
				Область.Значение = "";
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстСообщенияОбщий;
				Сообщение.Сообщить();
				
			Иначе
				
				Для Ном = 1 По 22 Цикл
					
					ТекСимв = Сред(НомерВедомости, Ном, 1);
					
					Если Ном = 9 ИЛИ Ном = 14 ИЛИ Ном = 19 ИЛИ Ном = 21 Тогда
						НомерВедомостиСоответствуетТребованиям = ТекСимв = "/";
					Иначе
						НомерВедомостиСоответствуетТребованиям = СтрНайти("1234567890", ТекСимв) > 0;
					КонецЕсли;
					
					Если НЕ НомерВедомостиСоответствуетТребованиям Тогда
						
						Область.Значение = "";
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = ТекстСообщенияОбщий;
						Сообщение.Сообщить();
						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяОбласти = Область.Имя;
	
	ПараметрыВводаПоля = СвойстваПоказателей.НайтиСтроки(Новый Структура("Показатель", ИмяОбласти));
	Если ПараметрыВводаПоля.Количество() > 0 Тогда
		ПараметрВводаПоля = ПараметрыВводаПоля[0];
		Если СтрДлина(СокрЛП(ЗначПоказателя)) <> 0 И ПараметрВводаПоля.Длина <> 0
			И СтрДлина(СокрЛП(ЗначПоказателя)) <> ПараметрВводаПоля.Длина Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Длина значения показателя должна быть равна " + ПараметрВводаПоля.Длина + "'");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	УстановитьДоступностьОбластей(ЭтаФорма);
	
	РасчетНаКлиенте(Область.Имя);  
	
	УстановитьТребованиеЗаполнения();
	
КонецПроцедуры

 &НаКлиенте
Процедура ОткрытьФормуВыбораВалютыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Область = ДополнительныеПараметры.Область;
	
	Если Результат <> Неопределено Тогда
		
		КодВалюты = КодЭлементаСправочника(Результат);
		
		Область.Значение = КодВалюты;
		
		ОбработатьИзменениеВалюты(КодВалюты);
		
		УстановитьКурсПриИзмененииВалюты();
		
		Модифицированность = Истина;
		
		УстановитьДоступностьОбластей(ЭтаФорма);
		
		РасчетНаКлиенте(Область.Имя);
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьИзменениеВалюты(КодВалюты)
	
	ВалютаПоКоду = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	Если ВалютаПоКоду <> Объект.Валюта Тогда
		Объект.Валюта = ВалютаПоКоду;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КодЭлементаСправочника(Ссылка)
	
	Возврат Ссылка.Код;
	
КонецФункции     

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОбластей(Форма)
	
	ТДО = Форма.ТабличныйДокумент.Области;
	
	
	Обл = ТДО.Найти("П000420006003");
	ВалютаВыплатыДохода_Рубли = Обл <> Неопределено И СокрЛП(Обл.Значение) = "643";
	
	// Переопределение свойств ячейки с показателем строки 020.
	ОпредЗначение = СокрЛП(ТДО["П000420001403"].Значение);
	Обл = ТДО.Найти("П000420002003");
	Если Обл <> Неопределено Тогда
		Если ОпредЗначение = "0" Тогда
			ЗапретитьВводДанныхВОбласть(Форма, Обл);
		Иначе
			РазрешитьВводДанныхВОбласть(Форма, Обл);
		КонецЕсли;
	КонецЕсли;
	
	// Переопределение свойств ячейки с показателем строки 050.
	Обл = ТДО.Найти("П000420005003");
	Если Обл <> Неопределено Тогда
		Обл.Формат = ?(ВалютаВыплатыДохода_Рубли, "ЧЦ=15;ЧДЦ=0;ЧН=-", "ЧЦ=19;ЧДЦ=4;ЧРД=,;ЧН=-");
		Обл.Значение = ?(ВалютаВыплатыДохода_Рубли, Окр(Обл.Значение), Обл.Значение);
	КонецЕсли;
	
	// Переопределение свойств ячейки с показателем строки 080.
	Обл = ТДО.Найти("П000420008003");
	Если Обл <> Неопределено Тогда
		Если ВалютаВыплатыДохода_Рубли Тогда
			ЗапретитьВводДанныхВОбласть(Форма, Обл);
		Иначе
			РазрешитьВводДанныхВОбласть(Форма, Обл);
		КонецЕсли;
	КонецЕсли;
	
	// Переопределение свойств ячейки с показателем строки 090.
	Обл = ТДО.Найти("П000420009003");
	Если Обл <> Неопределено Тогда
		Обл.Защита   = Истина;
		Обл.ЦветФона = Форма.мСтруктураЦветовРаскраски["_4"];
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗапретитьВводДанныхВОбласть(Форма, ОбрабатываемаяОбласть, ОчищатьЗначение = Истина)
	
	ЦветНедоступнойОбласти = Форма.мСтруктураЦветовРаскраски["_5"];
	
	ОбрабатываемаяОбласть.Защита   = Истина;
	ОбрабатываемаяОбласть.ЦветФона = ЦветНедоступнойОбласти;
	
	Если ОчищатьЗначение Тогда
		ОбрабатываемаяОбласть.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РазрешитьВводДанныхВОбласть(Форма, ОбрабатываемаяОбласть)
	
	ЦветОбластиРучногоВвода = Форма.мСтруктураЦветовРаскраски["_0"];
	
	ОбрабатываемаяОбласть.Защита   = Ложь;
	ОбрабатываемаяОбласть.ЦветФона = ЦветОбластиРучногоВвода;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьТребованиеЗаполнения()   
	
	Объект.ТребуетсяЗаполнение = CW_ДоходыНерезидентовДополнительный.ПолучитьТребованиеЗаполнения(ТабличныйДокумент, Объект.Приказ); 
	УстановитьНадписьПредупреждения();
	
КонецПроцедуры   

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент) 
	
	Элемент = Элементы.ТабличныйДокумент;
	
	Область = ТабличныйДокумент.Область("П000420006003");
	Область.Значение = КодЭлементаСправочника(Объект.Ссылка);

	ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область);

	УстановитьКурсПриИзмененииВалюты();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКурсПриИзмененииВалюты() 
	
	Элемент = Элементы.ТабличныйДокумент;
	Область = ТабличныйДокумент.Область("П000420008003");
	Область.Значение = ПолучитьКурсВалютыНаСервере();  
	
	ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область);

КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалютыНаСервере()  
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		Возврат 0;
	КонецЕсли;
	
	ДанныеКурса =  РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
	Возврат ДанныеКурса.Курс / ДанныеКурса.Кратность;
	
КонецФункции


#Область Авторасчет

&НаКлиенте
Процедура РасчетНаКлиенте(ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ОбластьИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ОбластьИмя = "") Экспорт
	

	ТДО = Форма.ТабличныйДокумент.Области;
	
	Если ЗначениеЗаполнено(ОбластьИмя) Тогда
		
		КодВалютыВыплатыДохода = СокрЛП(ТДО["П000420006003"].Значение);
		
		Если КодВалютыВыплатыДохода = "643" Тогда
			ТДО["П000420009003"].Значение = Окр(ТДО["П000420005003"].Значение);
		Иначе
			ТДО["П000420009003"].Значение
			= Окр(Окр(ТДО["П000420005003"].Значение, 4) * Окр(ТДО["П000420008003"].Значение, 4));
		КонецЕсли;  

	КонецЕсли;
	
	Форма.Объект.СуммаДохода 	= ТДО["П000420005003"].Значение;
	                            	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти 

//Команда заполнить
&НаКлиенте
Процедура Заполнить(Команда)

	РезультатВыполнения =  НачатьЗаполнениеВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьЗаполнениеСписка", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры  

&НаСервере
Функция НачатьЗаполнениеВФоне()    
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Приказ", 					Объект.Приказ);
	ПараметрыПроцедуры.Вставить("ДатаНачала", 				НачалоДня(Объект.Дата));
	ПараметрыПроцедуры.Вставить("ДатаОкончания",			КонецДня(Объект.Дата));
	ПараметрыПроцедуры.Вставить("Организация", 				Объект.Организация);
	ПараметрыПроцедуры.Вставить("Регистратор", 				Объект.Документ);
	ПараметрыПроцедуры.Вставить("ИгнорироватьИсключения",	Истина); 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение списка документов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ДоходыНерезидентовПакетноеФормированиеСведенийОДоходах.ПолучитьСписокДоходов",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции          

&НаКлиенте
Процедура ЗавершитьЗаполнениеСписка(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		Если НЕ ЕстьДанныеВТаблице(РезультатВыполнения.АдресРезультата) Тогда
			ПоказатьПредупреждение(, "Сведений о доходах не найдены!");
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗавешитьЗаполнениеФормы", ЭтотОбъект);      
			
			СтруктураПараметров = Новый	 Структура;
			СтруктураПараметров.Вставить("АдресРезультата", РезультатВыполнения.АдресРезультата);
			
			ОткрытьФорму("Справочник.CW_ДоходыНерезидентовСведенияОДоходах.Форма.ФормаЗаполнения", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось получить список документов!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка получения списка документов");
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ЕстьДанныеВТаблице(АдресРезультата)
	
	ТаблицаДокументов = ПолучитьИзВременногоХранилища(АдресРезультата);
	Возврат ТаблицаДокументов.Количество() <> 0;
	
КонецФункции

&НаКлиенте
Процедура ЗавешитьЗаполнениеФормы(РезультатВыбора, ДополнительныеПарамеры) Экспорт  
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	ЗаполнитьТабличныйДокументНаСервере(РезультатВыбора);

	Модифицированность = Истина;
	УстановитьДоступностьОбластей(ЭтаФорма);
	УстановитьТребованиеЗаполнения();
	
КонецПроцедуры   

&НаСервере
процедура ЗаполнитьТабличныйДокументНаСервере(РезультатВыбора)
	
	СоответствиеПриказаМакета = CW_ДоходыНерезидентовДополнительный.ПолучитьСоответствиеПриказаИмениМакета();
	СоответствиеЗначенийЯчеек = CW_ДоходыНерезидентовДополнительный.ПолучитьСоответствиеЗначенийЯчеек(Объект.Приказ);
	Для Каждого ЭлементСоответствия из  СоответствиеЗначенийЯчеек Цикл
		ПарамтерыФункции = Новый Структура;
		ПарамтерыФункции.Вставить("ВычисляемаяФункция", ЭлементСоответствия.Значение);
		ПарамтерыФункции.Вставить("Период",				РезультатВыбора.Период);
		ПарамтерыФункции.Вставить("Контрагент",			РезультатВыбора.Контрагент);
		ПарамтерыФункции.Вставить("ДоговорКонтрагента",	РезультатВыбора.ДоговорКонтрагента);
		ПарамтерыФункции.Вставить("Валюта",				РезультатВыбора.Валюта);
		ПарамтерыФункции.Вставить("СуммаПоДокументу",	РезультатВыбора.СуммаПоДокументу);
		ПарамтерыФункции.Вставить("Организация",		Объект.Организация);
		ПарамтерыФункции.Вставить("Документ",			Объект.Документ); 
		
		ВычесленноеЗначение = CW_ДоходыНерезидентовДополнительный.ВычислитьЗначениеЯчейки(ПарамтерыФункции);
		Если СокрЛП(ВычесленноеЗначение) = "<Пустое значение>"
			или СокрЛП(ВычесленноеЗначение) = "<>" Тогда
			ВычесленноеЗначение = "";	
		КонецЕсли;

		ТабличныйДокумент.Область(ЭлементСоответствия.Ключ).Значение = ВычесленноеЗначение;
	КонецЦикла;  
	
	Объект.Контрагент 			= РезультатВыбора.Контрагент;
	Объект.ДоговорКонтрагента 	= РезультатВыбора.ДоговорКонтрагента;
	Объект.Валюта 				= РезультатВыбора.Валюта;
	Объект.СуммаДохода 			= РезультатВыбора.СуммаПоДокументу;
	
КонецПроцедуры  
//Команда заполнить
